# GetInterpolatingCurves Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferencePoint..::..GetInterpolatingCurves Method
ReferencePoint Class See Also
---
The set of CurveByPoints elements that interpolate a ReferencePoint.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CurveByPointsArray GetInterpolatingCurves()
```

Visual Basic
---
```text
Public Function GetInterpolatingCurves As CurveByPointsArray
```

Visual C++
---
```text
public:
CurveByPointsArray^ GetInterpolatingCurves()
```

# Remarks
A CurveByPoints is in the GetInterpolatingCurves()()()() array if and only if the ReferencePoint is in the Points array of CurveByPoints.
# See Also
ReferencePoint Class
Autodesk.Revit.DB Namespace